app/controllers/users/registrations_controller.rb

  def create
    p Rails.configuration.database_configuration["development"]["database"]
    @user = User.create(user_params)
---
INSERT INTO "users" ("email", "encrypted_password", "location", "first_name", "last_name", "county", "cell_number", "services_needed_or_provided", "yes_transit", "no_transit", "age_16", "age_17", "age_18_up", "zip_code", "hero", "volunteer", "babysitting", "grocery_shopping", "e_learning_assistance", "sunday", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "morning", "afternoon", "evening", "night", "c_morning", "c_afternoon", "c_evening", "c_night", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36) RETURNING "id"